# SQL Workshop

Welcome to the hands-on portion of this workshop! In this notebook, you will walk through writing basic queries using the **movies** dataset.

If you're not familiar with Jupyter Notebooks, press **shift + enter** to run cells. If you accidentally click on one of the text cells (Markdown cells), just run it and it will look normal again. When you re-open the notebook, you need to re-run all the cells (go to Cell tab at the top to do this).

First, run the cells below to set up the notebook.

In [1]:
import os
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [3]:
engine = create_engine('sqlite://', echo=False)

## Movies Dataset
First we need to read in our Movies dataset .csv file into a pandas dataframe. This way, it is easier to create a sqlite engine to run SQL statements on our dataset.

In [4]:
movies = pd.read_csv('movie_metadata.csv')

In [5]:
movies.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

To find all the column names, we can run `movies.columns`:

In [6]:
movies.columns

Index(['color', 'director_name', 'num_critic_for_reviews', 'duration',
       'director_facebook_likes', 'actor_3_facebook_likes', 'actor_2_name',
       'actor_1_facebook_likes', 'gross', 'genres', 'actor_1_name',
       'movie_title', 'num_voted_users', 'cast_total_facebook_likes',
       'actor_3_name', 'facenumber_in_poster', 'plot_keywords',
       'movie_imdb_link', 'num_user_for_reviews', 'language', 'country',
       'content_rating', 'budget', 'title_year', 'actor_2_facebook_likes',
       'imdb_score', 'aspect_ratio', 'movie_facebook_likes'],
      dtype='object')

The `to_sql` method writes records stored in a dataframe to a SQL database.

In [7]:
movies.to_sql('movies', con=engine)

5043

## 1. Examples
What do you think these example SQL statements will output? Note that when we run SQL queries in this notebook, they must be written in the format `engine.execute("...").fetchall()` in order to run correctly. Additionally, the result will be a list.

**Question 1.1** This query uses `DISTINCT` and `WHERE`.

In [9]:
query = """
        SELECT distinct(actor_2_name)
        FROM movies
        WHERE imdb_score > 8.5
        """

pd.read_sql(query, engine).head()

    actor_2_name
0   Heath Ledger
1  Anne Hathaway
2      Tom Hardy
3  Orlando Bloom
4     Billy Boyd

**Question 1.2** This query uses `LIKE`.

In [11]:
query = """
        SELECT movie_title 
        FROM movies 
        WHERE genres LIKE '%Thriller%'
        """
pd.read_sql(query, engine).head()

              movie_title
0                SpectreÂ
1  The Dark Knight RisesÂ
2             BattleshipÂ
3         Jurassic WorldÂ
4                SkyfallÂ

**Question 1.3** This query uses `GROUP BY`, `ORDER BY`, and `LIMIT`.

In [12]:
query = """
        SELECT country, avg(duration) 
        FROM movies 
        GROUP BY country 
        ORDER BY avg(duration) DESC 
        LIMIT 10;
        """
pd.read_sql(query, engine).head()

        country  avg(duration)
0       Iceland     230.333333
1         Libya     156.000000
2  West Germany     155.666667
3      Thailand     142.800000
4      Slovakia     141.000000

## 2. Your turn!
**Question 2.1** Show the titles of all the movies that have a content rating of R and durations under 100.

*Note:* Remember that you can call `movies.columns` to refer back to all the column names in the dataframe. Just create another cell with the plus sign above.

In [13]:
query = """
        SELECT ...
        FROM ...
        WHERE ...
        """
pd.read_sql(query, engine).head()

     movie_title
0  The CampaignÂ
1         DreddÂ
2     SwordfishÂ
3       SoldierÂ
4    Snake EyesÂ

**Question 2.2** Show the titles and the duration of all the movies that have Action as a genre.

*Hint:* Look [here](https://www.w3resource.com/sqlite/like-operator.php) for the documentation for comparing strings.  
*Hint:* Note that a movie can have multiple genres, so you might want to check what the `genres` column looks like first.

In [ ]:
query = """
        SELECT ...
        FROM ...
        WHERE ...
        """
pd.read_sql(query, engine).head()

**Question 2.3** Show the directors that earned the top 5 largest total gross sum.

In [15]:
query = """
        SELECT ...
        FROM ... 
        GROUP ...
        ORDER BY ...
        """
pd.read_sql(query, engine).head()

      director_name           sum
0  Steven Spielberg  4.114233e+09
1     Peter Jackson  2.592969e+09
2       Michael Bay  2.231243e+09
3        Tim Burton  2.071275e+09
4         Sam Raimi  2.049549e+09

**Question 2.4** Show the 5 countries that have the highest average IMDB scores.

In [16]:
query = """
        SELECT ...
        FROM ...
        GROUP BY ...
        ORDER BY ...
        LIMIT ...
        """
pd.read_sql(query, engine).head()

    country  avg_imdb
0   Bahamas       4.4
1  New Line       4.4
2     Aruba       4.8
3      Peru       5.4
4   Belgium       5.6

## 3. Harder SQL

In [17]:
# run to look at as a reference
movies.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

---
**Question 3.1** Of the movies that have an `imdb_score` lower than 5, find the number of English movies made in the U.S. or U.K. There should be 412 total.

In [10]:
query = """
        ...
        """
pd.read_sql(query, engine).head()

   COUNT(movie_title)
0                 412

---
**3.2** Find all the directors with an average `imdb_score` of less than 5 across all their movies, with the worst director on top.

In [19]:
query = """
        ...
        """
pd.read_sql(query, engine).head()

      director_name  AVG(imdb_score)
0    John Blanchard              9.5
1  Sadyk Sher-Niyaz              8.7
2  Mitchell Altieri              8.7
3         Cary Bell              8.7
4      Mike Mayhall              8.6

---
**3.3** Find the `content_rating`, the `COUNT`, and the `AVG` movie Facebook likes of the number of movies of that type `ORDER BY` least popular on average based on Facebook likes.

In [20]:
query = """
        ...
        """
pd.read_sql(query, engine).head()

  content_rating  COUNT(movie_title)  AVG(movie_facebook_likes)
0          TV-MA                  20               13095.000000
1          PG-13                1461               11051.508556
2          TV-14                  30                9462.733333
3              R                2118                7476.420208
4             PG                 701                5993.680456

---
**3.4** Find two different ways to get the name and length of the longest movie in the dataset. The length of the movie must not be missing (not none).

*Hint*: One potential solution involves using subqueries.

In [21]:
query = """
        ...
        """

pd.read_sql(query, engine).head()

  movie_title  duration
0     AvatarÂ      178.0
1     AvatarÂ      178.0
2     AvatarÂ      178.0
3     AvatarÂ      178.0
4     AvatarÂ      178.0

---
**3.5** Find the movie_titles that start with the letter 'K' that were directed by directors with an avg `imdb_score` rating of over 5 (if a director has an average imdb score above 5, find all of the movies that were directed by that director that start with the letter 'K').

In [ ]:
query = """
        ...
        """

pd.read_sql(query, engine).head()

---

Thoughtful Question: Why might we have an issue with using ORDER BY and LIMIT 1 to find the maximum or minimum?  

Answer: In the case that we have more than one maximum or minimum, LIMIT 1 would prevent us from seeing it. As you write more SQL, you'll see these edge cases more clearly, so be very clear what the question is asking, and what your query is returning!

---
**CHALLENGE:** Open-ended questions to try to find the answer to!

1. How can we rate the movies in terms of popularity? One way to approach this is to assume that IMDB's score is not a holistic view of a given movie, and that we can use Facebook likes as a good measurement of popularity. Try weighting each column, ex:  

| Column         | Weight |
|----------------|--------|
| IMDB Score     | 40%    |
| Actor 1 Likes  | 10%    |
| Actor 2 Likes  | 10%    |
| Actor 3 Likes  | 10%    |
| Director Likes | 30%    |

2. Which country is the most popular in terms of movies they produced? Try using the table you created from question 1's query to answer this question. Set a variable equal to the output after calling `pd.read_sql()`, and then use that variable name in your FROM statement.